# В файле находиться N натуральных чиселзаписанных через пробел,
# среди чисел не хватает одного чтобы выполнить условие A[i] - 1 = A[i-1]. 
# # Найдите это число.
# with open('test.txt', 'r') as file:
#     a = list(map(int, file.read().split()))
#     for i in range(len(a) - 1):
#         if a[i] + 1 != a[i + 1]:
#             print(a[i] +1)
# Дан список чисел. Создайте список, в который попадают числа, описываемые 
# возрастающую последовательность. Порядок элементов менять нельзя.


# Напишите программу удаляющую из текста все слова содержащие "абв".
# txt = input("Введите текст через пробел:\n")
# print(f"Исходный текст: {txt}")
# find_txt = "абв"
# lst = [i for i in txt.split() if find_txt not in i]
# print(f'Результат: {" ".join(lst)}')
# Домашнее задание
# Напишите программу, удаляющую из текста все слова, содержащие ""абв"".
# Создайте программу для игры с конфетами человек против человека.
# Условие задачи: На столе лежит 2021 конфета. Играют два игрока делая ход друг после друга. Первый ход определяется жеребьёвкой. За один ход можно забрать не более чем 28 конфет. Все конфеты оппонента достаются сделавшему последний ход. Сколько конфет нужно взять первому игроку, чтобы забрать все конфеты у своего конкурента?
# a) Добавьте игру против бота
# b) Подумайте как наделить бота ""интеллектом""
# Создайте программу для игры в ""Крестики-нолики"".
# Реализуйте RLE алгоритм: реализуйте модуль сжатия и восстановления данных.
# Входные и выходные данные хранятся в отдельных текстовых файлах.